Repository: ltdangkhoa/upuzzle
Catalog: lib/l10n/arb/app_*.arb
Languages: uk, vi

source: Hello World!
uk: Привіт Світ!
vi: Xin chào!

source: Start game
uk: Почни гру
vi: Bắt đầu

source: Leaderboard
uk: Таблиця лідерів

source: Back
uk: Назад

source: Submit score
uk: Подати оцінку

source: Submitted
uk: Подано

source: Choose a player name
uk: Виберіть ім’я гравця

source: Start game
uk: Почни гру
vi: Bắt đầu

source: Hint
uk: Натяк
vi: Gợi ý

source: Next level
uk: Рівнем вище
vi: Lên cấp

source: Total moves
uk: Загальні кроки
vi: Số lượt đi

source: Simple
uk: Простий
vi: Đơn giản

source: Books Stack
uk: Книги стека
vi: Xếp sách

source: Pyramid Saving
uk: Збереження піраміди
vi: Kim Tự Tháp

# howToPlaySimple
source: How to play - UPuzzle will randomly a stack of tiles with its own number - You need to arrange the stack in ascending order from the top - Each move will bring the picked item to the top and push others down
uk: Як грати - UPuzzle буде випадковим чином стек плиток з власним числом - Вам потрібно організувати стек у висхідному порядку з вершини - Кожен крок принесе вибраний елемент до вершини і натисніть інших вниз
vi: Hướng dẫn - UPuzzle sẽ đưa ra một hàng các thanh có kèm theo số bị xáo trộn thứ tự - Bạn cần phải sắp xếp sao cho thứ tự các thanh được xếp từ thấp đến cao - Mỗi lượt chọn sẽ di chuyển thanh chọn lên trên cùng

# howToPlayBooksStack
source: How to play - There is a stack of series books which have been disorder in title number. - You are required to arrange these books in ascending order from the top. - Each pick will bring out the book to let you know the title number and others will pushing down
uk: Як грати - Існує стек серії книг, які були розладом у заголовку номера. - Ви повинні організувати ці книги у висхідному порядку з вершини. - кожен вибір виведе книгу, щоб повідомити вам номер назви, а інші
vi: Hướng dẫn - Một chồng sách có số thứ tự bị xáo trộn vị trí. - Hãy giúp sắp xếp lại theo đúng thứ tự tăng dần từ trên xuống. - Mỗi lượt chọn sẽ mang cuốn sách ra để bạn biết số thứ tự. Những cuốn sách còn lại sẽ bị đẩy xuống.

# howToPlayPyramid
source: How to play - Pyramid have been sunk to the ocean with unordered slides. Can you help for saving the pyramid with its original triangle shape? - Each move will bring the slide to above the sea surface to let you know the slide's shape
uk: Як грати - Піраміда була затонула до океану з неупорядкованими слайдами. Ви можете допомогти зберегти піраміду з оригінальною формою трикутника? - Кожен крок принесе слайд над поверхнею моря, щоб повідомити вам форму слайда
vi: Hướng dẫn - Kim tự tháp bị chìm dưới biển với các mảnh ngang bị thay đổi vị trí. Bạn có thể giúp xếp lại hình dạng kim tự tháp? - Mỗi lượt di chuyển sẽ mang mảnh ngang lên khỏi mặt nước để bạn biết được hình dạng mảnh ngang đó.
